Before configuring terraform and FortiGate redundant interface, some basic knowledge needs to be mastered:

> 
> FortiGate Redundancy: https://docs.fortinet.com/document/fortigate/6.4.0/administration-guide/567758/aggregation-and-redundancy
> 
> Terraform basic syntax: 
> Locals: https://www.terraform.io/docs/language/values/locals.html, https://learn.hashicorp.com/tutorials/terraform/locals
> Dynamic Blocks: https://www.terraform.io/docs/language/expressions/dynamic-blocks.html
> Import: https://www.terraform.io/docs/cli/import/index.html 

**Detailed Steps and Validation:**

_**Step1 Prepare the prerequisites**_

Make sure that the interface to be added to member is not referenced by any other place, as described in https://docs.fortinet.com/document/fortigate/6.4.0/administration-guide/567758/aggregation-and-redundancy:

> 
> Redundancy
> In a redundant interface, traffic only goes over one interface at any time. This differs from an aggregated interface where traffic goes over all interfaces for increased bandwidth. This difference means redundant interfaces can have more robust configurations with fewer possible points of failure. This is important in a fully-meshed HA configuration.
> 
> An interface is available to be in a redundant interface if:
> 
> It is a physical interface and not a VLAN interface.
> It is not already part of an aggregated or redundant interface.
> It is in the same VDOM as the redundant interface.
> It does not have an IP address and is not configured for DHCP or PPPoE.
> It has no DHCP server or relay configured on it.
> It does not have any VLAN subinterfaces.
> It is not referenced in any security policy, VIP, or multicast policy.
> It is not monitored by HA.
> It is not one of the FortiGate-5000 series backplane interfaces.
> When an interface is included in a redundant interface, it is not listed on the Network > Interfaces page. You cannot configure the interface individually and it is not available for inclusion in security policies, VIPs, or routing.

_**Step2 Show TF Configuration:**_

```hcl

provider "fortios" {
  hostname = "192.168.52.177"
  insecure = "true"
  token    = "GNH7r40H65GNb46kd4rG8rtrmn0fr1"
}

locals  {
  redunantmeb = [
    {
        interface_name = "port3"
    },
    {
        interface_name = "port4"
    },
  ]
}

resource "fortios_system_interface" "trname" {
    algorithm                                  = "L4"
    bfd_desired_min_tx                         = 250
    bfd_detect_mult                            = 3
    bfd_required_min_rx                        = 250
    defaultgw                                  = "enable"
    ip                                         = "0.0.0.0 0.0.0.0"
    mtu                                        = 1500
    mtu_override                               = "disable"
    name                                       = "testri"
    status                                     = "up"
    type                                       = "redundant"
    vdom                                       = "root"
    dynamic_sort_subtable                      = true

    dynamic "member" {
        for_each = local.redunantmeb

        content {
            interface_name = member.value.interface_name
        }
    }
}

```
_**Step3 Terraform apply and plan:**_
```

# terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_system_interface.trname will be created
  + resource "fortios_system_interface" "trname" {
      + ac_name                                    = (known after apply)
      + aggregate                                  = (known after apply)
      + algorithm                                  = "L4"
      + alias                                      = (known after apply)
      + allowaccess                                = (known after apply)
      + ap_discover                                = (known after apply)
      + arpforward                                 = (known after apply)
      + auth_type                                  = (known after apply)
      + auto_auth_extension_device                 = (known after apply)
      + autogenerated                              = (known after apply)
      + bandwidth_measure_time                     = (known after apply)
      + bfd                                        = (known after apply)
      + bfd_desired_min_tx                         = 250
 
 .................
 
      + username                                   = (known after apply)
      + vdom                                       = "root"
      + vindex                                     = (known after apply)
      + vlan_protocol                              = (known after apply)
      + vlanforward                                = (known after apply)
      + vlanid                                     = (known after apply)
      + vrf                                        = (known after apply)
      + vrrp_virtual_mac                           = (known after apply)
      + wccp                                       = (known after apply)
      + weight                                     = (known after apply)
      + wins_ip                                    = (known after apply)

      + member {
          + interface_name = "port3"
        }
      + member {
          + interface_name = "port4"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_system_interface.trname: Creating...
fortios_system_interface.trname: Creation complete after 1s [id=testri]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

# terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

fortios_system_interface.trname: Refreshing state... [id=testri]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```


_**Step4 Check result:**_

```
labfirewall # config system interface

labfirewall (interface) # show
config system interface
    edit "testri"
        set vdom "root"
        set type redundant
        set member "port3" "port4"
        set snmp-index 7
    next
end

```

![1](https://user-images.githubusercontent.com/49291382/120743230-75392e00-c4ad-11eb-8dc2-7b661a24a7a1.png)


We can find that it has been configured successfully.


BTW: When you come across a parameter that you don’t know how to configure, then you can try to  configure a simple template on the FortiGate GUI/CLI, and use the terraform import function to import the configuration on the FGT into Terraform, and then use terraform show to see the contents of the exported terraform hcl format. This can also provide some help.

